Revit 2026 API

# RailingSlopeOption Enumeration

---

The option determines the slope of the railing.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RailingSlopeOption
```
```vb
Public Enumeration RailingSlopeOption
```
```cpp
public enum class RailingSlopeOption
```
```fsharp
type RailingSlopeOption
```

| Member name | Value | Description |
| --- | --- | --- |
| ByHost | 0 | The slope of the railing is determined by its host. |
| Flat | 1 | The slope of the railing will be kept flat. |
| Sloped | 2 | The slope of the railing will be specified by users. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace